
from random import choice as ch

from datetime import datetime
from time import mktime, gmtime


current_time = datetime.fromtimestamp(mktime(gmtime())+10800)


eq_list = ['СХД NetApp FAS2650', 'СХД NetApp E2860', 'СХД NetApp AFF A250', 'Cisco Catalyst 9500',
                    'Cisco Catalyst 9300', 'Cisco Catalyst 9500', 'Eltex MES1124M']

Name_unique = [
    '502.B11', '502.B13', '502.B14', '502.B15', '502.B16', '502.B18', '502.B21', '502.B22', 
    '502.B23', '502.B24', '502.B25', '502.B26', '502.B27', '502.B28', '502.B31', '502.B32', 
    '502.B34', '502.B35', '502.B36', '502.B37', '502.B41', '502.B42', '502.B44', '502.B45', 
    '502.B46', '502.B47', '502.B48', '502.B49', '701.A1', '701.A2', '701.A3', '701.A4', 
    '701.A5', '701.A6', '701.A7', '701.A8', '701.B1', '701.B2', '701.B3', '701.B4', 
    '701.B5', '701.B6', '701.B7', '701.C1', '701.C2', '701.C3', '701.C4', '701.C5', 
    '701.C6', '701.C7', '701.C8', '701.C9', '701.D1', '701.D2', '701.D3', '701.D4', 
    '701.D5', '701.D6', '701.D7', '701.D9', '701.H2', '701.H3', '702.E10', '702.E11', 
    '702.E7', '702.E9', '702.F1', '702.F10', '702.F11', '702.F2', '702.F3', '702.F4', 
    '702.F5', '702.F6', '702.F7', '702.F8', '702.G1', '702.G10', '702.G11', '702.G2', 
    '702.G3', '702.G5', '702.G6', '702.G7', '702.G8', '702.H1', '702.H10', '702.H2', 
    '702.H3', '702.H4', '702.H5', '702.H6', '702.H7', '702.H9', '804.A1', '804.A10', 
    '804.A11', '804.A3', '804.A4', '804.A5', '804.A6', '804.A7', '804.A8', '804.A9', 
    '804.B1', '804.B10', '804.B11', '804.B2', '804.B3', '804.B4', '804.B5', '804.B6', 
    '804.B7', '804.B8', '804.C1', '804.C10', '804.C11', '804.C3', '804.C6', '804.C7', 
    '804.C8', '804.C9', '804.D1', '804.D10', '804.D11', '804.D12', '804.D2', '804.D3', 
    '804.D4', '804.D5', '804.D6', '804.D7', '804.D8', '804.D9'
]

Rack_unique = [
    'A1', 'A10', 'A11', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'A9', 'B1', 'B10', 
    'B11', 'B13', 'B14', 'B15', 'B16', 'B18', 'B2', 'B21', 'B22', 'B23', 'B24', 'B25', 
    'B26', 'B27', 'B28', 'B3', 'B31', 'B32', 'B34', 'B35', 'B36', 'B37', 'B4', 'B41', 
    'B42', 'B44', 'B45', 'B46', 'B47', 'B48', 'B49', 'B5', 'B6', 'B7', 'B8', 'C1', 'C10', 
    'C11', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9', 'D1', 'D10', 'D11', 'D12', 
    'D2', 'D3', 'D4', 'D5', 'D6', 'D7', 'D8', 'D9', 'E10', 'E11', 'E7', 'E9', 'F1', 
    'F10', 'F11', 'F2', 'F3', 'F4', 'F5', 'F6', 'F7', 'F8', 'G1', 'G10', 'G11', 'G2', 
    'G3', 'G5', 'G6', 'G7', 'G8', 'H1', 'H10', 'H2', 'H3', 'H4', 'H5', 'H6', 'H7', 'H9'
]

DH_unique = [
    '502', '701', '702', '804'
]

Client_unique = [
    'DSD', 'DSH', 'DSP', 'DSS'
]


Name_pdpm_unique = [
    'PDU-5/1/1-C', 'PDU-5/1/3-C', 'PDU-5/1/4-D', 'PDU-5/1/5-D', 'PDU-5/3/1-F',
    'PDU-5/3/2-B', 'PDU-5/3/3-F', 'PDU-5/3/4-B', 'PDU-5/4/1-A', 'PDU-5/4/2-D',
    'PDU-5/4/3-F', 'PDU-5/4/4-A', 'PDU-5/4/5-F', 'PDU-5/4/6-A', 'PDU-5/4/7-D',
    'PDU-5/4/8-E', 'PDU-5/5/1-E', 'PDU-5/5/3-E', 'PDU-5/5/4-A', 'PDU-5/5/5-A',
    'PDU-7/1/1-B', 'PDU-7/1/2-C', 'PDU-7/1/3-B', 'PDU-7/2/3-A', 'PDU-7/4/2-F',
    'PDU-7/4/3-E', 'PDU-7/4/4-F', 'PDU-8/2/4-C', 'PDU-8/2/5-A', 'PDU-8/2/6-C',
    'PDU-8/3/1-B', 'PDU-8/3/2-D', 'PDU-8/3/3-B', 'PDU-8/3/4-D', 'PDU-8/3/5-B',
    'PDU-8/3/6-D', 'PDU-8/4/1-D', 'PDU-8/4/2-E', 'PDU-8/4/3-D', 'PDU-8/4/4-E',
    'PDU-8/4/5-D', 'PDU-8/4/6-E', 'PDU-8/4/7-D', 'PDU-8/4/8-E'
]

DH_pdpm_unique = [
    '501', '503', '504', '505', '701', '702', '704', '802', '803', '804'
]

Rack_pdpm_unique = [
    'A1', 'A2', 'A3', 'A7', 'B10', 'B2', 'B21', 'B6', 'B71', 'B85', 'C1', 'C28',
    'C41', 'C62', 'C66', 'C9', 'D11', 'D2', 'D6', 'D8', 'E1', 'E3', 'E5', 'E6',
    'E8', 'F10', 'F2', 'F5', 'F9', 'G1', 'G5', 'G7', 'H1', 'H10', 'H3', 'H5',
    'I2', 'I7', 'В47'
]

Circuit_pdpm_unique = [
    '1/1', '1/2', '1/3', '10/1', '10/2', '10/3', '11/1', '12/1', '12/2', '12/3',
    '13/1', '13/2', '13/3', '14/1', '17/1', '17/2', '17/3', '19/1', '19/2',
    '19/3', '2/1', '2/2', '2/3', '20/1', '20/2', '20/3', '21/1', '21/2', '21/3',
    '22/1', '22/2', '22/3', '23/3', '24/1', '24/2', '24/3', '3/1', '3/2', '3/3',
    '4/1', '4/2', '5/1', '5/2', '5/3', '6/2', '6/3', '7/2', '8/1', '8/2', '8/3',
    '9/1', '9/2', '9/3'
]

Stream_unique = ['A', 'B', 'C', 'D', 'E', 'F']


rack_name = ch(Name_unique)
rack = ch(Rack_unique)
dh = ch(DH_unique)
client = ch(Client_unique)
pdu = ch(Name_pdpm_unique)
dh_pdpm = ch(DH_pdpm_unique)
rack_pdpm = ch(Rack_pdpm_unique)
circuit_pdpm= ch(Circuit_pdpm_unique)
stream = ch(Stream_unique)
equipment = ch(eq_list)


electicity_turnoff_pdpm = {"email_subject": "Отключение электропитания (PDPM)",
                           'email_body':
f"""Тестирование!!!Коллеги, информируем вас о том, что {current_time} на станцию BMS поступило сообщение о падении мощности {pdu}, автомат {circuit_pdpm},
{dh_pdpm}.{rack_pdpm} до 0 кВт.
Статус автоматического выключателя - «OPEN» (линия разомкнута).
Сообщено главному инженеру Колоскову Тимофею и дежурному CS. Направлены дежурные инженеры для осмотра оборудования.
Клиент - {client}""" }

text_2 = {'email_subject':
           "Отключение электропитания (PDU)", 'email_body': 
f"""Тестирование!!!
Коллеги, информируем вас о том, что {current_time} в {rack_name} системами мониторинга было зафисировано отключение {rack}.PDU-{pdu}.
Клиент - {client}"""}

text_3 = {'email_subject':"Отключение электропитания оборудования во время обслуживание инфраструктуры",
          'email_body': 
f"""Тестирование!!!
Коллеги, информируем вас о том, что {current_time} при проведении планового обслуживания луча питания {stream}, инженерами ДатаСпейс зафиксировано отключение {rack_name}.PDU-{stream}.
В настоящее время стойка обесточена.\n Также напоминаем вам, что работы по обслуживанию луча питания {stream} не могут быть отменены, либо приостановлены.
Клиент - {client}"""}

text_4 = {'email_subject':"Изменение мироклимата стойки",
          'email_body': 
f"""Тестирование!!!
Коллеги, информируем вас о том, что  при проведении планового обслуживания луча питания {stream}, инженерами ДатаСпейс зафиксировано отключение {rack_name}.PDU-{stream}.
В настоящее время стойка обесточена.\n Также напоминаем вам, что работы по обслуживанию луча питания {stream} не могут быть отменены, либо приостановлены.
Клиент - {client}"""}

text_5 = {'email_subject':"Аварийное сообщение инфраструктурного оборудования ДХ",
          'email_body': 
f"""Тестирование!!!
Информируем вас о том, что сегодня " + $data + " в " + $time + " поступил аварийный сигнал с устройства раннего обнаружения задымления VESDA машинного зала " + $DH + ".
Необходим доступ в машинный зал для диагностики и устранения возможной аварии.
Просим согласовать незамедлительный доступ в машинный зал " + $DH + " для проведения осмотра и диагностики!"""}

text_6 = {'email_subject':"Снижение мощности в стойке",
          'email_body': 
f"""Тестирование!!!
Информируем вас о том, что сегодня {current_time} на станцию BMS поступило сообщение о падении мощности на {pdu} {circuit_pdpm}, {dh_pdpm}.{rack_pdpm} до 0.0 kW.
Согласно данным CBAS статус автомата CLOSED (включен).
Клиент - {client}"""}

text_7 = {'email_subject':"Подключение KVM",
          'email_body': 
f"""Добрый день!
Подключите пожалуйста kvm к {equipment} в стойке {rack_name}. Подключить нужно к консольному порту.
Клиент - {client}"""}

temp_list = [electicity_turnoff_pdpm, text_2, text_3, text_4, text_5, text_6, text_7]

